# Напишіть функцію common_elements, яка згенерує два списки елементів з генераторного виразу (range)
# для 100 елементів, за наступними правилом:
# Один список з числами кратними 3, інший з кратними числами 5.
# За допомогою множин створіть набір з числами, які є в обох множинах (перетин).
# Функція повинна повернути цю множину як результат своєї роботи.

def common_elements():
    list_one = range(0, 100, 3)
    list_two = range(0, 100, 5)
    intersection_set = set(list_one).intersection(list_two)
    return intersection_set


assert common_elements() == {0, 75, 45, 15, 90, 60, 30}