# Ваше завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
# Приклади:
# Copy code
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1

number = input("Введіть ціле число: ")

multiply = 10#задаємо контрольне число для роботи циклу > 9
result = 1#лічильник множення цифр числа
while multiply > 9:#цикл працює поки добуток більше 9
    for digit in number:#цикл щоб перемножити все цифри числа
        result = result * int(digit)
    multiply = result#прирівнюємо контрольне число до результату добутку щоб перевірити чи повинен далі працювати цикл
    number = str(result)#оновлюємо початкове число для подальших операцій
    result = 1#знову зводимо лічильник до одиниці для правильного добутку цифр нового числа
print(number)