# На вхід функції popular_words передаються два аргументи. Текст та список слів, популярність яких необхідно визначити.
# При вирішенні цього завдання зверніть увагу на такі моменти
# Слова необхідно шукати у всіх регістрах. Тобто. якщо необхідно знайти слово "one",
# значить для нього будуть підходити слова "one", "One", "oNe", "ONE" і т.д.
# Шукані слова завжди вказані в нижньому регістрі
# Якщо слово не знайдено жодного разу, його необхідно повернути у словнику зі значенням 0 (нуль)
# Вхідні параметри: Текст і масив слів, що шукаються.
# Вихідні параметри: Словник, у якому ключами є шукані слова та значеннями,
# скільки разів кожнє слово зустрічаються у орігінальному тексті.
# from hw_lesson_6.hwl6_3 import result


def popular_words (text, words):
    result = dict() #створюємо словник, який бюудемо наповнювати
    text_for_search = text.lower().split()#понижуємо регістр та розділяємо строку на список слів
    for word in words:#цикл для підрахунку кількості входження слова у списку
        n = text_for_search.count(word)
        result[word] = n#додаємо слово та кількість його входжень у словник
    return result#

assert popular_words("When I was One I had just begun When I was Two I was nearly new ", ['i', 'was', 'three', 'near']) == { 'i': 4, 'was': 3, 'three': 0, 'near': 0 }, 'Test1'
print('OK')